templates/manifold_3d/constant/physicalProperties.j2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel  constant;

nu              [0 2 -1 0 0 0 0] {{ nu }};
